espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_event.h
//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL26
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// FLASH                    FLASH controller error event,  the status flags
//                          are FLASH:FEDACSTAT.FSM_DONE and
//                          FLASH:FEDACSTAT.RVF_INT
#define EVENT_CPUIRQSEL26_EV_W                                               8
#define EVENT_CPUIRQSEL26_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL26_EV_S                                               0
#define EVENT_CPUIRQSEL26_EV_FLASH                                  0x00000015

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL27
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SWEV0                    Software event 0, triggered by SWEV.SWEV0
#define EVENT_CPUIRQSEL27_EV_W                                               8
#define EVENT_CPUIRQSEL27_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL27_EV_S                                               0
#define EVENT_CPUIRQSEL27_EV_SWEV0                                  0x00000064

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL28
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// AUX_COMB                 AUX combined event, the corresponding flag
//                          register is here AUX_EVCTL:EVTOMCUFLAGS
#define EVENT_CPUIRQSEL28_EV_W                                               8
#define EVENT_CPUIRQSEL28_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL28_EV_S                                               0
#define EVENT_CPUIRQSEL28_EV_AUX_COMB                               0x0000000B

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL29
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// AON_PROG0                AON programmable event 0. Event selected by
//                          AON_EVENT  MCU event selector,
//                          AON_EVENT:EVTOMCUSEL.AON_PROG0_EV
#define EVENT_CPUIRQSEL29_EV_W                                               8
#define EVENT_CPUIRQSEL29_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL29_EV_S                                               0
#define EVENT_CPUIRQSEL29_EV_AON_PROG0                              0x00000001

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL30
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// ALWAYS_ACTIVE            Always asserted
// AON_RTC_UPD              RTC periodic event controlled by
//                          AON_RTC:CTL.RTC_UPD_EN
// AUX_OBSMUX0              Loopback of OBSMUX0 through AUX, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.MCU_OBSMUX0
// AUX_ADC_FIFO_ALMOST_FULL AUX ADC FIFO watermark event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_DONE             AUX ADC done, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_DONE
// AUX_SMPH_AUTOTAKE_DONE   Autotake event from AUX semaphore, configured by
//                          AUX_SMPH:AUTOTAKE
// AUX_TIMER1_EV            AUX timer 1 event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER1_EV
// AUX_TIMER0_EV            AUX timer 0 event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER0_EV
// AUX_TDC_DONE             AUX TDC measurement done event, corresponds to the
//                          flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TDC_DONE and
//                          the AUX_TDC status AUX_TDC:STAT.DONE
// AUX_COMPB                AUX Compare B event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB
// AUX_AON_WU_EV            AON wakeup event, the corresponding flag is here
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_WU_EV
// CRYPTO_DMA_DONE_IRQ      CRYPTO DMA input done event, the correspondingg
//                          flag is CRYPTO:IRQSTAT.DMA_IN_DONE. Controlled
//                          by CRYPTO:IRQEN.DMA_IN_DONE
// AUX_TIMER2_PULSE         AUX Timer2 pulse, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_PULSE
// AUX_TIMER2_EV3           AUX Timer2 event 3, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV3
// AUX_TIMER2_EV2           AUX Timer2 event 2, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV2
// AUX_TIMER2_EV1           AUX Timer2 event 1, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV1
// AUX_TIMER2_EV0           AUX Timer2 event 0, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV0
// DMA_CH18_DONE            DMA done for software tiggered UDMA channel 18,
//                          see UDMA0:SOFTREQ
// DMA_CH0_DONE             DMA done for software tiggered UDMA channel 0, see
//                          UDMA0:SOFTREQ
// AON_AUX_SWEV0            AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0
// I2S_IRQ                  Interrupt event from I2S
// AON_PROG2                AON programmable event 2. Event selected by
//                          AON_EVENT MCU event selector,
//                          AON_EVENT:EVTOMCUSEL.AON_PROG2_EV
// AON_PROG1                AON programmable event 1. Event selected by
//                          AON_EVENT MCU event selector,
//                          AON_EVENT:EVTOMCUSEL.AON_PROG1_EV
// NONE                     Always inactive
#define EVENT_CPUIRQSEL30_EV_W                                               8
#define EVENT_CPUIRQSEL30_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL30_EV_S                                               0
#define EVENT_CPUIRQSEL30_EV_ALWAYS_ACTIVE                          0x00000079
#define EVENT_CPUIRQSEL30_EV_AON_RTC_UPD                            0x00000077
#define EVENT_CPUIRQSEL30_EV_AUX_OBSMUX0                            0x00000072
#define EVENT_CPUIRQSEL30_EV_AUX_ADC_FIFO_ALMOST_FULL               0x00000071
#define EVENT_CPUIRQSEL30_EV_AUX_ADC_DONE                           0x00000070
#define EVENT_CPUIRQSEL30_EV_AUX_SMPH_AUTOTAKE_DONE                 0x0000006F
#define EVENT_CPUIRQSEL30_EV_AUX_TIMER1_EV                          0x0000006E
#define EVENT_CPUIRQSEL30_EV_AUX_TIMER0_EV                          0x0000006D
#define EVENT_CPUIRQSEL30_EV_AUX_TDC_DONE                           0x0000006C
#define EVENT_CPUIRQSEL30_EV_AUX_COMPB                              0x0000006B
#define EVENT_CPUIRQSEL30_EV_AUX_AON_WU_EV                          0x00000069
#define EVENT_CPUIRQSEL30_EV_CRYPTO_DMA_DONE_IRQ                    0x0000005E
#define EVENT_CPUIRQSEL30_EV_AUX_TIMER2_PULSE                       0x0000003C
#define EVENT_CPUIRQSEL30_EV_AUX_TIMER2_EV3                         0x0000003B
#define EVENT_CPUIRQSEL30_EV_AUX_TIMER2_EV2                         0x0000003A
#define EVENT_CPUIRQSEL30_EV_AUX_TIMER2_EV1                         0x00000039
#define EVENT_CPUIRQSEL30_EV_AUX_TIMER2_EV0                         0x00000038
#define EVENT_CPUIRQSEL30_EV_DMA_CH18_DONE                          0x00000016
#define EVENT_CPUIRQSEL30_EV_DMA_CH0_DONE                           0x00000014
#define EVENT_CPUIRQSEL30_EV_AON_AUX_SWEV0                          0x0000000A
#define EVENT_CPUIRQSEL30_EV_I2S_IRQ                                0x00000008
#define EVENT_CPUIRQSEL30_EV_AON_PROG2                              0x00000003
#define EVENT_CPUIRQSEL30_EV_AON_PROG1                              0x00000002
#define EVENT_CPUIRQSEL30_EV_NONE                                   0x00000000

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL31
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// AUX_COMPA                AUX Compare A event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
#define EVENT_CPUIRQSEL31_EV_W                                               8
#define EVENT_CPUIRQSEL31_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL31_EV_S                                               0
#define EVENT_CPUIRQSEL31_EV_AUX_COMPA                              0x0000006A

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL32
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// AUX_ADC_IRQ              AUX ADC interrupt event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_IRQ. Status
//                          flags are found here AUX_EVCTL:EVTOMCUFLAGS
#define EVENT_CPUIRQSEL32_EV_W                                               8
#define EVENT_CPUIRQSEL32_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL32_EV_S                                               0
#define EVENT_CPUIRQSEL32_EV_AUX_ADC_IRQ                            0x00000073

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL33
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// TRNG_IRQ                 TRNG Interrupt event, controlled by TRNG:IRQEN.EN
#define EVENT_CPUIRQSEL33_EV_W                                               8
#define EVENT_CPUIRQSEL33_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL33_EV_S                                               0
#define EVENT_CPUIRQSEL33_EV_TRNG_IRQ                               0x00000068

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL34
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// OSC_COMB                 Combined event from Oscillator control
#define EVENT_CPUIRQSEL34_EV_W                                               8
#define EVENT_CPUIRQSEL34_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL34_EV_S                                               0
#define EVENT_CPUIRQSEL34_EV_OSC_COMB                               0x00000006

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL35
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// AUX_TIMER2_EV0           AUX Timer2 event 0, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV0
#define EVENT_CPUIRQSEL35_EV_W                                               8
#define EVENT_CPUIRQSEL35_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL35_EV_S                                               0
#define EVENT_CPUIRQSEL35_EV_AUX_TIMER2_EV0                         0x00000038

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL36
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART1_COMB               UART1 combined interrupt, interrupt flags are
//                          found here UART1:MIS
#define EVENT_CPUIRQSEL36_EV_W                                               8
#define EVENT_CPUIRQSEL36_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL36_EV_S                                               0
#define EVENT_CPUIRQSEL36_EV_UART1_COMB                             0x00000025

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL37
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// BATMON_COMB              Combined event from battery monitor
#define EVENT_CPUIRQSEL37_EV_W                                               8
#define EVENT_CPUIRQSEL37_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL37_EV_S                                               0
#define EVENT_CPUIRQSEL37_EV_BATMON_COMB                            0x00000005

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL38
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI2_COMB                SSI2 combined interrupt, interrupt flags are found
//                          here SSI2:MIS
#define EVENT_CPUIRQSEL38_EV_W                                               8
#define EVENT_CPUIRQSEL38_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL38_EV_S                                               0
#define EVENT_CPUIRQSEL38_EV_SSI2_COMB                              0x0000007A

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL39
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI3_COMB                SSI3 combined interrupt, interrupt flags are found
//                          here SSI3:MIS
#define EVENT_CPUIRQSEL39_EV_W                                               8
#define EVENT_CPUIRQSEL39_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL39_EV_S                                               0
#define EVENT_CPUIRQSEL39_EV_SSI3_COMB                              0x0000007B

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL40
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART2_COMB               UART2 combined interrupt, interrupt flags are
//                          found here UART2:MIS
#define EVENT_CPUIRQSEL40_EV_W                                               8
#define EVENT_CPUIRQSEL40_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL40_EV_S                                               0
#define EVENT_CPUIRQSEL40_EV_UART2_COMB                             0x0000007C

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL41
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART3_COMB               UART3 combined interrupt, interrupt flags are
//                          found here UART3:MIS
#define EVENT_CPUIRQSEL41_EV_W                                               8
#define EVENT_CPUIRQSEL41_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL41_EV_S                                               0
#define EVENT_CPUIRQSEL41_EV_UART3_COMB                             0x0000007D

//*****************************************************************************
//
// Register: EVENT_O_CPUIRQSEL42
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// I2C1_IRQ                 Interrupt event from I2C1
#define EVENT_CPUIRQSEL42_EV_W                                               8
#define EVENT_CPUIRQSEL42_EV_M                                      0x000000FF
#define EVENT_CPUIRQSEL42_EV_S                                               0
#define EVENT_CPUIRQSEL42_EV_I2C1_IRQ                               0x0000007E

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL0
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// GPT0A_CMP                GPT0A compare event. Configured by GPT0:TAMR.TCACT
#define EVENT_RFCSEL0_EV_W                                                   8
#define EVENT_RFCSEL0_EV_M                                          0x000000FF
#define EVENT_RFCSEL0_EV_S                                                   0
#define EVENT_RFCSEL0_EV_GPT0A_CMP                                  0x0000003D

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL1
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// GPT0B_CMP                GPT0B compare event. Configured by GPT0:TBMR.TCACT
#define EVENT_RFCSEL1_EV_W                                                   8
#define EVENT_RFCSEL1_EV_M                                          0x000000FF
#define EVENT_RFCSEL1_EV_S                                                   0
#define EVENT_RFCSEL1_EV_GPT0B_CMP                                  0x0000003E

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL2
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// GPT1A_CMP                GPT1A compare event. Configured by GPT1:TAMR.TCACT
#define EVENT_RFCSEL2_EV_W                                                   8
#define EVENT_RFCSEL2_EV_M                                          0x000000FF
#define EVENT_RFCSEL2_EV_S                                                   0
#define EVENT_RFCSEL2_EV_GPT1A_CMP                                  0x0000003F

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL3
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// GPT1B_CMP                GPT1B compare event. Configured by GPT1:TBMR.TCACT
#define EVENT_RFCSEL3_EV_W                                                   8
#define EVENT_RFCSEL3_EV_M                                          0x000000FF
#define EVENT_RFCSEL3_EV_S                                                   0
#define EVENT_RFCSEL3_EV_GPT1B_CMP                                  0x00000040

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL4
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// GPT2A_CMP                GPT2A compare event. Configured by GPT2:TAMR.TCACT
#define EVENT_RFCSEL4_EV_W                                                   8
#define EVENT_RFCSEL4_EV_M                                          0x000000FF
#define EVENT_RFCSEL4_EV_S                                                   0
#define EVENT_RFCSEL4_EV_GPT2A_CMP                                  0x00000041

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL5
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// GPT2B_CMP                GPT2B compare event. Configured by GPT2:TBMR.TCACT
#define EVENT_RFCSEL5_EV_W                                                   8
#define EVENT_RFCSEL5_EV_M                                          0x000000FF
#define EVENT_RFCSEL5_EV_S                                                   0
#define EVENT_RFCSEL5_EV_GPT2B_CMP                                  0x00000042

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL6
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// GPT3A_CMP                GPT3A compare event. Configured by GPT3:TAMR.TCACT
#define EVENT_RFCSEL6_EV_W                                                   8
#define EVENT_RFCSEL6_EV_M                                          0x000000FF
#define EVENT_RFCSEL6_EV_S                                                   0
#define EVENT_RFCSEL6_EV_GPT3A_CMP                                  0x00000043

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL7
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// GPT3B_CMP                GPT3B compare event. Configured by GPT3:TBMR.TCACT
#define EVENT_RFCSEL7_EV_W                                                   8
#define EVENT_RFCSEL7_EV_M                                          0x000000FF
#define EVENT_RFCSEL7_EV_S                                                   0
#define EVENT_RFCSEL7_EV_GPT3B_CMP                                  0x00000044

//*****************************************************************************
//
// Register: EVENT_O_RFCSEL8
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// AON_RTC_UPD              RTC periodic event controlled by
//                          AON_RTC:CTL.RTC_UPD_EN
#define EVENT_RFCSEL8_EV_W                                                   8
#define EVENT_RFCSEL8_EV_M                                          0x000000FF
#define EVENT_RFCSEL8_EV_S                                                   0
#define EVENT_RFCSEL8_EV_AON_RTC_UPD                                0x00000077

