espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_event.h
//*****************************************************************************
//
// Register: EVENT_O_UDMACH14BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read/write selection value
//
// Writing any other value than values defined by a ENUM may result in
// undefined behavior.
// ENUMs:
// UART3_TX_DMASREQ         UART3 TX DMA single request, controlled by
//                          UART3:DMACTL.TXDMAE
// UART3_TX_DMABREQ         UART3 TX DMA burst request, controlled by
//                          UART3:DMACTL.TXDMAE
// UART3_RX_DMASREQ         UART3 RX DMA single request, controlled by
//                          UART3:DMACTL.RXDMAE
// UART3_RX_DMABREQ         UART3 RX DMA burst request, controlled by
//                          UART3:DMACTL.RXDMAE
// UART2_TX_DMASREQ         UART2 TX DMA single request, controlled by
//                          UART2:DMACTL.TXDMAE
// UART2_TX_DMABREQ         UART2 TX DMA burst request, controlled by
//                          UART2:DMACTL.TXDMAE
// UART2_RX_DMASREQ         UART2 RX DMA single request, controlled by
//                          UART2:DMACTL.RXDMAE
// UART2_RX_DMABREQ         UART2 RX DMA burst request, controlled by
//                          UART2:DMACTL.RXDMAE
// SSI3_TX_DMASREQ          SSI3 TX DMA single request, controlled by
//                          SSI2:DMACR.TXDMAE
// SSI3_TX_DMABREQ          SSI3 TX DMA burst request , controlled by
//                          SSI2:DMACR.TXDMAE
// SSI3_RX_DMASREQ          SSI3 RX DMA single request, controlled by
//                          SSI2:DMACR.RXDMAE
// SSI3_RX_DMABREQ          SSI3 RX DMA burst request , controlled by
//                          SSI2:DMACR.RXDMAE
// SSI2_TX_DMASREQ          SSI2 TX DMA single request, controlled by
//                          SSI2:DMACR.TXDMAE
// SSI2_TX_DMABREQ          SSI2 TX DMA burst request , controlled by
//                          SSI2:DMACR.TXDMAE
// SSI2_RX_DMASREQ          SSI2 RX DMA single request, controlled by
//                          SSI2:DMACR.RXDMAE
// SSI2_RX_DMABREQ          SSI2 RX DMA burst request , controlled by
//                          SSI2:DMACR.RXDMAE
// I2C1_IRQ                 Interrupt event from I2C1
// UART3_COMB               UART3 combined interrupt, interrupt flags are
//                          found here UART3:MIS
// UART2_COMB               UART2 combined interrupt, interrupt flags are
//                          found here UART2:MIS
// SSI3_COMB                SSI3 combined interrupt, interrupt flags are found
//                          here SSI3:MIS
// SSI2_COMB                SSI2 combined interrupt, interrupt flags are found
//                          here SSI2:MIS
// ALWAYS_ACTIVE            Always asserted
// CPU_HALTED               CPU halted
// AON_RTC_UPD              RTC periodic event controlled by
//                          AON_RTC:CTL.RTC_UPD_EN
// AUX_DMABREQ              DMA burst request event from AUX, configured by
//                          AUX_EVCTL:DMACTL
// AUX_DMASREQ              DMA single request event from AUX, configured by
//                          AUX_EVCTL:DMACTL
// AUX_SW_DMABREQ           DMA sofware trigger from AUX, triggered by
//                          AUX_EVCTL:DMASWREQ.START
// AUX_ADC_IRQ              AUX ADC interrupt event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_IRQ. Status
//                          flags are found here AUX_EVCTL:EVTOMCUFLAGS
// AUX_OBSMUX0              Loopback of OBSMUX0 through AUX, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.MCU_OBSMUX0
// AUX_ADC_FIFO_ALMOST_FULL AUX ADC FIFO watermark event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_FIFO_ALMOST_FULL
// AUX_ADC_DONE             AUX ADC done, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_ADC_DONE
// AUX_SMPH_AUTOTAKE_DONE   Autotake event from AUX semaphore, configured by
//                          AUX_SMPH:AUTOTAKE
// AUX_TIMER1_EV            AUX timer 1 event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER1_EV
// AUX_TIMER0_EV            AUX timer 0 event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER0_EV
// AUX_TDC_DONE             AUX TDC measurement done event, corresponds to the
//                          flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TDC_DONE and
//                          the AUX_TDC status AUX_TDC:STAT.DONE
// AUX_COMPB                AUX Compare B event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPB
// AUX_COMPA                AUX Compare A event, corresponds to
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_COMPA
// AUX_AON_WU_EV            AON wakeup event, the corresponding flag is here
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_WU_EV
// TRNG_IRQ                 TRNG Interrupt event, controlled by TRNG:IRQEN.EN
// SWEV3                    Software event 3, triggered by SWEV.SWEV3
// SWEV2                    Software event 2, triggered by SWEV.SWEV2
// SWEV1                    Software event 1, triggered by SWEV.SWEV1
// SWEV0                    Software event 0, triggered by SWEV.SWEV0
// WDT_NMI                  Watchdog non maskable interrupt event, controlled
//                          by WDT:CTL.INTTYPE
// CRYPTO_DMA_DONE_IRQ      CRYPTO DMA input done event, the correspondingg
//                          flag is CRYPTO:IRQSTAT.DMA_IN_DONE. Controlled
//                          by CRYPTO:IRQEN.DMA_IN_DONE
// CRYPTO_RESULT_AVAIL_IRQ  CRYPTO result available interupt event, the
//                          corresponding flag is found here
//                          CRYPTO:IRQSTAT.RESULT_AVAIL. Controlled by
//                          CRYPTO:IRQSTAT.RESULT_AVAIL
// PORT_EVENT7              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT7 wil be routed here.
// PORT_EVENT6              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT6 wil be routed here.
// PORT_EVENT5              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT4 wil be routed here.
// PORT_EVENT4              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT4 wil be routed here.
// PORT_EVENT3              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT3 wil be routed here.
// PORT_EVENT2              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT2 wil be routed here.
// PORT_EVENT1              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT1 wil be routed here.
// PORT_EVENT0              Port capture event from IOC, configured by
//                          IOC:IOCFGn.PORT_ID. Events on ports configured
//                          with ENUM PORT_EVENT0 wil be routed here.
// GPT3B_DMABREQ            GPT3B DMA trigger event. Configured by GPT3:DMAEV
// GPT3A_DMABREQ            GPT3A DMA trigger event. Configured by GPT3:DMAEV
// GPT2B_DMABREQ            GPT2B DMA trigger event. Configured by GPT2:DMAEV
// GPT2A_DMABREQ            GPT2A DMA trigger event. Configured by GPT2:DMAEV
// GPT1B_DMABREQ            GPT1B DMA trigger event. Configured by GPT1:DMAEV
// GPT1A_DMABREQ            GPT1A DMA trigger event. Configured by GPT1:DMAEV
// GPT0B_DMABREQ            GPT0B DMA trigger event. Configured by GPT0:DMAEV
// GPT0A_DMABREQ            GPT0A DMA trigger event. Configured by GPT0:DMAEV
// GPT3B_CMP                GPT3B compare event. Configured by GPT3:TBMR.TCACT
// GPT3A_CMP                GPT3A compare event. Configured by GPT3:TAMR.TCACT
// GPT2B_CMP                GPT2B compare event. Configured by GPT2:TBMR.TCACT
// GPT2A_CMP                GPT2A compare event. Configured by GPT2:TAMR.TCACT
// GPT1B_CMP                GPT1B compare event. Configured by GPT1:TBMR.TCACT
// GPT1A_CMP                GPT1A compare event. Configured by GPT1:TAMR.TCACT
// GPT0B_CMP                GPT0B compare event. Configured by GPT0:TBMR.TCACT
// GPT0A_CMP                GPT0A compare event. Configured by GPT0:TAMR.TCACT
// AUX_TIMER2_PULSE         AUX Timer2 pulse, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_PULSE
// AUX_TIMER2_EV3           AUX Timer2 event 3, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV3
// AUX_TIMER2_EV2           AUX Timer2 event 2, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV2
// AUX_TIMER2_EV1           AUX Timer2 event 1, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV1
// AUX_TIMER2_EV0           AUX Timer2 event 0, corresponding to flag
//                          AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV0
// UART1_TX_DMASREQ         UART1 TX DMA single request, controlled by
//                          UART1:DMACTL.TXDMAE
// UART1_TX_DMABREQ         UART1 TX DMA burst request, controlled by
//                          UART1:DMACTL.TXDMAE
// UART1_RX_DMASREQ         UART1 RX DMA single request, controlled by
//                          UART1:DMACTL.RXDMAE
// UART1_RX_DMABREQ         UART1 RX DMA burst request, controlled by
//                          UART1:DMACTL.RXDMAE
// UART0_TX_DMASREQ         UART0 TX DMA single request, controlled by
//                          UART0:DMACTL.TXDMAE
// UART0_TX_DMABREQ         UART0 TX DMA burst request, controlled by
//                          UART0:DMACTL.TXDMAE
// UART0_RX_DMASREQ         UART0 RX DMA single request, controlled by
//                          UART0:DMACTL.RXDMAE
// UART0_RX_DMABREQ         UART0 RX DMA burst request, controlled by
//                          UART0:DMACTL.RXDMAE
// SSI1_TX_DMASREQ          SSI1 TX DMA single request, controlled by
//                          SSI0:DMACR.TXDMAE
// SSI1_TX_DMABREQ          SSI1 TX DMA burst request , controlled by
//                          SSI0:DMACR.TXDMAE
// SSI1_RX_DMASREQ          SSI1 RX DMA single request, controlled by
//                          SSI0:DMACR.RXDMAE
// SSI1_RX_DMABREQ          SSI1 RX DMA burst request , controlled by
//                          SSI0:DMACR.RXDMAE
// SSI0_TX_DMASREQ          SSI0 TX DMA single request, controlled by
//                          SSI0:DMACR.TXDMAE
// SSI0_TX_DMABREQ          SSI0 TX DMA burst request , controlled by
//                          SSI0:DMACR.TXDMAE
// SSI0_RX_DMASREQ          SSI0 RX DMA single request, controlled by
//                          SSI0:DMACR.RXDMAE
// SSI0_RX_DMABREQ          SSI0 RX DMA burst request , controlled by
//                          SSI0:DMACR.RXDMAE
// DMA_DONE_COMB            Combined DMA done, corresponding flags are here
//                          UDMA0:REQDONE
// DMA_ERR                  DMA bus error, corresponds to UDMA0:ERROR.STATUS
// UART1_COMB               UART1 combined interrupt, interrupt flags are
//                          found here UART1:MIS
// UART0_COMB               UART0 combined interrupt, interrupt flags are
//                          found here UART0:MIS
// SSI1_COMB                SSI1 combined interrupt, interrupt flags are found
//                          here SSI1:MIS
// SSI0_COMB                SSI0 combined interrupt, interrupt flags are found
//                          here SSI0:MIS
// PKA_IRQ                  PKA Interrupt event
// RFC_CPE_1                Combined Interrupt for CPE Generated events.
//                          Corresponding flags are here
//                          RFC_DBELL:RFCPEIFG. Only interrupts selected
//                          with CPE1 in RFC_DBELL:RFCPEIFG can trigger a
//                          RFC_CPE_1 event
// AUX_SWEV1                AUX software event 1, triggered by
//                          AUX_EVCTL:SWEVSET.SWEV1, also available as
//                          AUX_EVENT2 AON wake up event.
//                          MCU domain wakeup control
//                          AON_EVENT:MCUWUSEL
// RFC_CPE_0                Combined Interrupt for CPE Generated events.
//                          Corresponding flags are here
//                          RFC_DBELL:RFCPEIFG. Only interrupts selected
//                          with CPE0 in RFC_DBELL:RFCPEIFG can trigger a
//                          RFC_CPE_0 event
// RFC_HW_COMB              Combined RFC hardware interrupt, corresponding
//                          flag is here RFC_DBELL:RFHWIFG
// RFC_CMD_ACK              RFC Doorbell Command Acknowledgement Interrupt,
//                          equvialent to RFC_DBELL:RFACKIFG.ACKFLAG
// WDT_IRQ                  Watchdog interrupt event, controlled by
//                          WDT:CTL.INTEN
// DMA_CH18_DONE            DMA done for software tiggered UDMA channel 18,
//                          see UDMA0:SOFTREQ
// FLASH                    FLASH controller error event,  the status flags
//                          are FLASH:FEDACSTAT.FSM_DONE and
//                          FLASH:FEDACSTAT.RVF_INT
// DMA_CH0_DONE             DMA done for software tiggered UDMA channel 0, see
//                          UDMA0:SOFTREQ
// GPT1B                    GPT1B interrupt event, controlled by GPT1:TBMR
// GPT1A                    GPT1A interrupt event, controlled by GPT1:TAMR
// GPT0B                    GPT0B interrupt event, controlled by GPT0:TBMR
// GPT0A                    GPT0A interrupt event, controlled by GPT0:TAMR
// GPT3B                    GPT3B interrupt event, controlled by GPT3:TBMR
// GPT3A                    GPT3A interrupt event, controlled by GPT3:TAMR
// GPT2B                    GPT2B interrupt event, controlled by GPT2:TBMR
// GPT2A                    GPT2A interrupt event, controlled by GPT2:TAMR
// AUX_COMB                 AUX combined event, the corresponding flag
//                          register is here AUX_EVCTL:EVTOMCUFLAGS
// AON_AUX_SWEV0            AUX Software event 0, AUX_EVCTL:SWEVSET.SWEV0
// I2C_IRQ                  Interrupt event from I2C
// I2S_IRQ                  Interrupt event from I2S
// AON_RTC_COMB             Event from AON_RTC, controlled by the
//                          AON_RTC:CTL.COMB_EV_MASK setting
// OSC_COMB                 Combined event from Oscillator control
// BATMON_COMB              Combined event from battery monitor
// AON_GPIO_EDGE            Edge detect event from IOC. Configureded by the
//                          IOC:IOCFGn.EDGE_IRQ_EN and  IOC:IOCFGn.EDGE_DET
//                          settings
// AON_PROG2                AON programmable event 2. Event selected by
//                          AON_EVENT MCU event selector,
//                          AON_EVENT:EVTOMCUSEL.AON_PROG2_EV
// AON_PROG1                AON programmable event 1. Event selected by
//                          AON_EVENT MCU event selector,
//                          AON_EVENT:EVTOMCUSEL.AON_PROG1_EV
// AON_PROG0                AON programmable event 0. Event selected by
//                          AON_EVENT  MCU event selector,
//                          AON_EVENT:EVTOMCUSEL.AON_PROG0_EV
// NONE                     Always inactive
#define EVENT_UDMACH14BSEL_EV_W                                              8
#define EVENT_UDMACH14BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH14BSEL_EV_S                                              0
#define EVENT_UDMACH14BSEL_EV_UART3_TX_DMASREQ                      0x0000008E
#define EVENT_UDMACH14BSEL_EV_UART3_TX_DMABREQ                      0x0000008D
#define EVENT_UDMACH14BSEL_EV_UART3_RX_DMASREQ                      0x0000008C
#define EVENT_UDMACH14BSEL_EV_UART3_RX_DMABREQ                      0x0000008B
#define EVENT_UDMACH14BSEL_EV_UART2_TX_DMASREQ                      0x0000008A
#define EVENT_UDMACH14BSEL_EV_UART2_TX_DMABREQ                      0x00000089
#define EVENT_UDMACH14BSEL_EV_UART2_RX_DMASREQ                      0x00000088
#define EVENT_UDMACH14BSEL_EV_UART2_RX_DMABREQ                      0x00000087
#define EVENT_UDMACH14BSEL_EV_SSI3_TX_DMASREQ                       0x00000086
#define EVENT_UDMACH14BSEL_EV_SSI3_TX_DMABREQ                       0x00000085
#define EVENT_UDMACH14BSEL_EV_SSI3_RX_DMASREQ                       0x00000084
#define EVENT_UDMACH14BSEL_EV_SSI3_RX_DMABREQ                       0x00000083
#define EVENT_UDMACH14BSEL_EV_SSI2_TX_DMASREQ                       0x00000082
#define EVENT_UDMACH14BSEL_EV_SSI2_TX_DMABREQ                       0x00000081
#define EVENT_UDMACH14BSEL_EV_SSI2_RX_DMASREQ                       0x00000080
#define EVENT_UDMACH14BSEL_EV_SSI2_RX_DMABREQ                       0x0000007F
#define EVENT_UDMACH14BSEL_EV_I2C1_IRQ                              0x0000007E
#define EVENT_UDMACH14BSEL_EV_UART3_COMB                            0x0000007D
#define EVENT_UDMACH14BSEL_EV_UART2_COMB                            0x0000007C
#define EVENT_UDMACH14BSEL_EV_SSI3_COMB                             0x0000007B
#define EVENT_UDMACH14BSEL_EV_SSI2_COMB                             0x0000007A
#define EVENT_UDMACH14BSEL_EV_ALWAYS_ACTIVE                         0x00000079
#define EVENT_UDMACH14BSEL_EV_CPU_HALTED                            0x00000078
#define EVENT_UDMACH14BSEL_EV_AON_RTC_UPD                           0x00000077
#define EVENT_UDMACH14BSEL_EV_AUX_DMABREQ                           0x00000076
#define EVENT_UDMACH14BSEL_EV_AUX_DMASREQ                           0x00000075
#define EVENT_UDMACH14BSEL_EV_AUX_SW_DMABREQ                        0x00000074
#define EVENT_UDMACH14BSEL_EV_AUX_ADC_IRQ                           0x00000073
#define EVENT_UDMACH14BSEL_EV_AUX_OBSMUX0                           0x00000072
#define EVENT_UDMACH14BSEL_EV_AUX_ADC_FIFO_ALMOST_FULL              0x00000071
#define EVENT_UDMACH14BSEL_EV_AUX_ADC_DONE                          0x00000070
#define EVENT_UDMACH14BSEL_EV_AUX_SMPH_AUTOTAKE_DONE                0x0000006F
#define EVENT_UDMACH14BSEL_EV_AUX_TIMER1_EV                         0x0000006E
#define EVENT_UDMACH14BSEL_EV_AUX_TIMER0_EV                         0x0000006D
#define EVENT_UDMACH14BSEL_EV_AUX_TDC_DONE                          0x0000006C
#define EVENT_UDMACH14BSEL_EV_AUX_COMPB                             0x0000006B
#define EVENT_UDMACH14BSEL_EV_AUX_COMPA                             0x0000006A
#define EVENT_UDMACH14BSEL_EV_AUX_AON_WU_EV                         0x00000069
#define EVENT_UDMACH14BSEL_EV_TRNG_IRQ                              0x00000068
#define EVENT_UDMACH14BSEL_EV_SWEV3                                 0x00000067
#define EVENT_UDMACH14BSEL_EV_SWEV2                                 0x00000066
#define EVENT_UDMACH14BSEL_EV_SWEV1                                 0x00000065
#define EVENT_UDMACH14BSEL_EV_SWEV0                                 0x00000064
#define EVENT_UDMACH14BSEL_EV_WDT_NMI                               0x00000063
#define EVENT_UDMACH14BSEL_EV_CRYPTO_DMA_DONE_IRQ                   0x0000005E
#define EVENT_UDMACH14BSEL_EV_CRYPTO_RESULT_AVAIL_IRQ               0x0000005D
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT7                           0x0000005C
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT6                           0x0000005B
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT5                           0x0000005A
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT4                           0x00000059
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT3                           0x00000058
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT2                           0x00000057
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT1                           0x00000056
#define EVENT_UDMACH14BSEL_EV_PORT_EVENT0                           0x00000055
#define EVENT_UDMACH14BSEL_EV_GPT3B_DMABREQ                         0x00000054
#define EVENT_UDMACH14BSEL_EV_GPT3A_DMABREQ                         0x00000053
#define EVENT_UDMACH14BSEL_EV_GPT2B_DMABREQ                         0x00000052
#define EVENT_UDMACH14BSEL_EV_GPT2A_DMABREQ                         0x00000051
#define EVENT_UDMACH14BSEL_EV_GPT1B_DMABREQ                         0x00000050
#define EVENT_UDMACH14BSEL_EV_GPT1A_DMABREQ                         0x0000004F
#define EVENT_UDMACH14BSEL_EV_GPT0B_DMABREQ                         0x0000004E
#define EVENT_UDMACH14BSEL_EV_GPT0A_DMABREQ                         0x0000004D
#define EVENT_UDMACH14BSEL_EV_GPT3B_CMP                             0x00000044
#define EVENT_UDMACH14BSEL_EV_GPT3A_CMP                             0x00000043
#define EVENT_UDMACH14BSEL_EV_GPT2B_CMP                             0x00000042
#define EVENT_UDMACH14BSEL_EV_GPT2A_CMP                             0x00000041
#define EVENT_UDMACH14BSEL_EV_GPT1B_CMP                             0x00000040
#define EVENT_UDMACH14BSEL_EV_GPT1A_CMP                             0x0000003F
#define EVENT_UDMACH14BSEL_EV_GPT0B_CMP                             0x0000003E
#define EVENT_UDMACH14BSEL_EV_GPT0A_CMP                             0x0000003D
#define EVENT_UDMACH14BSEL_EV_AUX_TIMER2_PULSE                      0x0000003C
#define EVENT_UDMACH14BSEL_EV_AUX_TIMER2_EV3                        0x0000003B
#define EVENT_UDMACH14BSEL_EV_AUX_TIMER2_EV2                        0x0000003A
#define EVENT_UDMACH14BSEL_EV_AUX_TIMER2_EV1                        0x00000039
#define EVENT_UDMACH14BSEL_EV_AUX_TIMER2_EV0                        0x00000038
#define EVENT_UDMACH14BSEL_EV_UART1_TX_DMASREQ                      0x00000037
#define EVENT_UDMACH14BSEL_EV_UART1_TX_DMABREQ                      0x00000036
#define EVENT_UDMACH14BSEL_EV_UART1_RX_DMASREQ                      0x00000035
#define EVENT_UDMACH14BSEL_EV_UART1_RX_DMABREQ                      0x00000034
#define EVENT_UDMACH14BSEL_EV_UART0_TX_DMASREQ                      0x00000033
#define EVENT_UDMACH14BSEL_EV_UART0_TX_DMABREQ                      0x00000032
#define EVENT_UDMACH14BSEL_EV_UART0_RX_DMASREQ                      0x00000031
#define EVENT_UDMACH14BSEL_EV_UART0_RX_DMABREQ                      0x00000030
#define EVENT_UDMACH14BSEL_EV_SSI1_TX_DMASREQ                       0x0000002F
#define EVENT_UDMACH14BSEL_EV_SSI1_TX_DMABREQ                       0x0000002E
#define EVENT_UDMACH14BSEL_EV_SSI1_RX_DMASREQ                       0x0000002D
#define EVENT_UDMACH14BSEL_EV_SSI1_RX_DMABREQ                       0x0000002C
#define EVENT_UDMACH14BSEL_EV_SSI0_TX_DMASREQ                       0x0000002B
#define EVENT_UDMACH14BSEL_EV_SSI0_TX_DMABREQ                       0x0000002A
#define EVENT_UDMACH14BSEL_EV_SSI0_RX_DMASREQ                       0x00000029
#define EVENT_UDMACH14BSEL_EV_SSI0_RX_DMABREQ                       0x00000028
#define EVENT_UDMACH14BSEL_EV_DMA_DONE_COMB                         0x00000027
#define EVENT_UDMACH14BSEL_EV_DMA_ERR                               0x00000026
#define EVENT_UDMACH14BSEL_EV_UART1_COMB                            0x00000025
#define EVENT_UDMACH14BSEL_EV_UART0_COMB                            0x00000024
