espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_event.h
#define EVENT_UDMACH14BSEL_EV_SSI1_COMB                             0x00000023
#define EVENT_UDMACH14BSEL_EV_SSI0_COMB                             0x00000022
#define EVENT_UDMACH14BSEL_EV_PKA_IRQ                               0x0000001F
#define EVENT_UDMACH14BSEL_EV_RFC_CPE_1                             0x0000001E
#define EVENT_UDMACH14BSEL_EV_AUX_SWEV1                             0x0000001D
#define EVENT_UDMACH14BSEL_EV_RFC_CPE_0                             0x0000001B
#define EVENT_UDMACH14BSEL_EV_RFC_HW_COMB                           0x0000001A
#define EVENT_UDMACH14BSEL_EV_RFC_CMD_ACK                           0x00000019
#define EVENT_UDMACH14BSEL_EV_WDT_IRQ                               0x00000018
#define EVENT_UDMACH14BSEL_EV_DMA_CH18_DONE                         0x00000016
#define EVENT_UDMACH14BSEL_EV_FLASH                                 0x00000015
#define EVENT_UDMACH14BSEL_EV_DMA_CH0_DONE                          0x00000014
#define EVENT_UDMACH14BSEL_EV_GPT1B                                 0x00000013
#define EVENT_UDMACH14BSEL_EV_GPT1A                                 0x00000012
#define EVENT_UDMACH14BSEL_EV_GPT0B                                 0x00000011
#define EVENT_UDMACH14BSEL_EV_GPT0A                                 0x00000010
#define EVENT_UDMACH14BSEL_EV_GPT3B                                 0x0000000F
#define EVENT_UDMACH14BSEL_EV_GPT3A                                 0x0000000E
#define EVENT_UDMACH14BSEL_EV_GPT2B                                 0x0000000D
#define EVENT_UDMACH14BSEL_EV_GPT2A                                 0x0000000C
#define EVENT_UDMACH14BSEL_EV_AUX_COMB                              0x0000000B
#define EVENT_UDMACH14BSEL_EV_AON_AUX_SWEV0                         0x0000000A
#define EVENT_UDMACH14BSEL_EV_I2C_IRQ                               0x00000009
#define EVENT_UDMACH14BSEL_EV_I2S_IRQ                               0x00000008
#define EVENT_UDMACH14BSEL_EV_AON_RTC_COMB                          0x00000007
#define EVENT_UDMACH14BSEL_EV_OSC_COMB                              0x00000006
#define EVENT_UDMACH14BSEL_EV_BATMON_COMB                           0x00000005
#define EVENT_UDMACH14BSEL_EV_AON_GPIO_EDGE                         0x00000004
#define EVENT_UDMACH14BSEL_EV_AON_PROG2                             0x00000003
#define EVENT_UDMACH14BSEL_EV_AON_PROG1                             0x00000002
#define EVENT_UDMACH14BSEL_EV_AON_PROG0                             0x00000001
#define EVENT_UDMACH14BSEL_EV_NONE                                  0x00000000

//*****************************************************************************
//
// Register: EVENT_O_UDMACH15BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// AON_RTC_COMB             Event from AON_RTC, controlled by the
//                          AON_RTC:CTL.COMB_EV_MASK setting
#define EVENT_UDMACH15BSEL_EV_W                                              8
#define EVENT_UDMACH15BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH15BSEL_EV_S                                              0
#define EVENT_UDMACH15BSEL_EV_AON_RTC_COMB                          0x00000007

//*****************************************************************************
//
// Register: EVENT_O_UDMACH16SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_RX_DMASREQ          SSI1 RX DMA single request, controlled by
//                          SSI0:DMACR.RXDMAE
#define EVENT_UDMACH16SSEL_EV_W                                              8
#define EVENT_UDMACH16SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH16SSEL_EV_S                                              0
#define EVENT_UDMACH16SSEL_EV_SSI1_RX_DMASREQ                       0x0000002D

//*****************************************************************************
//
// Register: EVENT_O_UDMACH16BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_RX_DMABREQ          SSI1 RX DMA burst request , controlled by
//                          SSI0:DMACR.RXDMAE
#define EVENT_UDMACH16BSEL_EV_W                                              8
#define EVENT_UDMACH16BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH16BSEL_EV_S                                              0
#define EVENT_UDMACH16BSEL_EV_SSI1_RX_DMABREQ                       0x0000002C

//*****************************************************************************
//
// Register: EVENT_O_UDMACH17SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_TX_DMASREQ          SSI1 TX DMA single request, controlled by
//                          SSI0:DMACR.TXDMAE
#define EVENT_UDMACH17SSEL_EV_W                                              8
#define EVENT_UDMACH17SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH17SSEL_EV_S                                              0
#define EVENT_UDMACH17SSEL_EV_SSI1_TX_DMASREQ                       0x0000002F

//*****************************************************************************
//
// Register: EVENT_O_UDMACH17BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI1_TX_DMABREQ          SSI1 TX DMA burst request , controlled by
//                          SSI0:DMACR.TXDMAE
#define EVENT_UDMACH17BSEL_EV_W                                              8
#define EVENT_UDMACH17BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH17BSEL_EV_S                                              0
#define EVENT_UDMACH17BSEL_EV_SSI1_TX_DMABREQ                       0x0000002E

//*****************************************************************************
//
// Register: EVENT_O_UDMACH19SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI2_RX_DMASREQ          SSI2 RX DMA single request, controlled by
//                          SSI2:DMACR.RXDMAE
#define EVENT_UDMACH19SSEL_EV_W                                              8
#define EVENT_UDMACH19SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH19SSEL_EV_S                                              0
#define EVENT_UDMACH19SSEL_EV_SSI2_RX_DMASREQ                       0x00000080

//*****************************************************************************
//
// Register: EVENT_O_UDMACH19BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI2_RX_DMABREQ          SSI2 RX DMA burst request , controlled by
//                          SSI2:DMACR.RXDMAE
#define EVENT_UDMACH19BSEL_EV_W                                              8
#define EVENT_UDMACH19BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH19BSEL_EV_S                                              0
#define EVENT_UDMACH19BSEL_EV_SSI2_RX_DMABREQ                       0x0000007F

//*****************************************************************************
//
// Register: EVENT_O_UDMACH20SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI2_TX_DMASREQ          SSI2 TX DMA single request, controlled by
//                          SSI2:DMACR.TXDMAE
#define EVENT_UDMACH20SSEL_EV_W                                              8
#define EVENT_UDMACH20SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH20SSEL_EV_S                                              0
#define EVENT_UDMACH20SSEL_EV_SSI2_TX_DMASREQ                       0x00000082

//*****************************************************************************
//
// Register: EVENT_O_UDMACH20BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI2_TX_DMABREQ          SSI2 TX DMA burst request , controlled by
//                          SSI2:DMACR.TXDMAE
#define EVENT_UDMACH20BSEL_EV_W                                              8
#define EVENT_UDMACH20BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH20BSEL_EV_S                                              0
#define EVENT_UDMACH20BSEL_EV_SSI2_TX_DMABREQ                       0x00000081

//*****************************************************************************
//
// Register: EVENT_O_UDMACH21SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SWEV0                    Software event 0, triggered by SWEV.SWEV0
#define EVENT_UDMACH21SSEL_EV_W                                              8
#define EVENT_UDMACH21SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH21SSEL_EV_S                                              0
#define EVENT_UDMACH21SSEL_EV_SWEV0                                 0x00000064

//*****************************************************************************
//
// Register: EVENT_O_UDMACH21BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SWEV0                    Software event 0, triggered by SWEV.SWEV0
#define EVENT_UDMACH21BSEL_EV_W                                              8
#define EVENT_UDMACH21BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH21BSEL_EV_S                                              0
#define EVENT_UDMACH21BSEL_EV_SWEV0                                 0x00000064

//*****************************************************************************
//
// Register: EVENT_O_UDMACH22SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SWEV1                    Software event 1, triggered by SWEV.SWEV1
#define EVENT_UDMACH22SSEL_EV_W                                              8
#define EVENT_UDMACH22SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH22SSEL_EV_S                                              0
#define EVENT_UDMACH22SSEL_EV_SWEV1                                 0x00000065

//*****************************************************************************
//
// Register: EVENT_O_UDMACH22BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SWEV1                    Software event 1, triggered by SWEV.SWEV1
#define EVENT_UDMACH22BSEL_EV_W                                              8
#define EVENT_UDMACH22BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH22BSEL_EV_S                                              0
#define EVENT_UDMACH22BSEL_EV_SWEV1                                 0x00000065

//*****************************************************************************
//
// Register: EVENT_O_UDMACH23SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SWEV2                    Software event 2, triggered by SWEV.SWEV2
#define EVENT_UDMACH23SSEL_EV_W                                              8
#define EVENT_UDMACH23SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH23SSEL_EV_S                                              0
#define EVENT_UDMACH23SSEL_EV_SWEV2                                 0x00000066

//*****************************************************************************
//
// Register: EVENT_O_UDMACH23BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SWEV2                    Software event 2, triggered by SWEV.SWEV2
#define EVENT_UDMACH23BSEL_EV_W                                              8
#define EVENT_UDMACH23BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH23BSEL_EV_S                                              0
#define EVENT_UDMACH23BSEL_EV_SWEV2                                 0x00000066

//*****************************************************************************
//
// Register: EVENT_O_UDMACH24SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SWEV3                    Software event 3, triggered by SWEV.SWEV3
#define EVENT_UDMACH24SSEL_EV_W                                              8
#define EVENT_UDMACH24SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH24SSEL_EV_S                                              0
#define EVENT_UDMACH24SSEL_EV_SWEV3                                 0x00000067

//*****************************************************************************
//
// Register: EVENT_O_UDMACH24BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SWEV3                    Software event 3, triggered by SWEV.SWEV3
#define EVENT_UDMACH24BSEL_EV_W                                              8
#define EVENT_UDMACH24BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH24BSEL_EV_S                                              0
#define EVENT_UDMACH24BSEL_EV_SWEV3                                 0x00000067

//*****************************************************************************
//
// Register: EVENT_O_UDMACH25SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI3_RX_DMASREQ          SSI3 RX DMA single request, controlled by
//                          SSI2:DMACR.RXDMAE
#define EVENT_UDMACH25SSEL_EV_W                                              8
#define EVENT_UDMACH25SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH25SSEL_EV_S                                              0
#define EVENT_UDMACH25SSEL_EV_SSI3_RX_DMASREQ                       0x00000084

//*****************************************************************************
//
// Register: EVENT_O_UDMACH25BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI3_RX_DMABREQ          SSI3 RX DMA burst request , controlled by
//                          SSI2:DMACR.RXDMAE
#define EVENT_UDMACH25BSEL_EV_W                                              8
#define EVENT_UDMACH25BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH25BSEL_EV_S                                              0
#define EVENT_UDMACH25BSEL_EV_SSI3_RX_DMABREQ                       0x00000083

//*****************************************************************************
//
// Register: EVENT_O_UDMACH26SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI3_TX_DMASREQ          SSI3 TX DMA single request, controlled by
//                          SSI2:DMACR.TXDMAE
#define EVENT_UDMACH26SSEL_EV_W                                              8
#define EVENT_UDMACH26SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH26SSEL_EV_S                                              0
#define EVENT_UDMACH26SSEL_EV_SSI3_TX_DMASREQ                       0x00000086

//*****************************************************************************
//
// Register: EVENT_O_UDMACH26BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// SSI3_TX_DMABREQ          SSI3 TX DMA burst request , controlled by
//                          SSI2:DMACR.TXDMAE
#define EVENT_UDMACH26BSEL_EV_W                                              8
#define EVENT_UDMACH26BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH26BSEL_EV_S                                              0
#define EVENT_UDMACH26BSEL_EV_SSI3_TX_DMABREQ                       0x00000085

//*****************************************************************************
//
// Register: EVENT_O_UDMACH28SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART2_RX_DMASREQ         UART2 RX DMA single request, controlled by
//                          UART2:DMACTL.RXDMAE
#define EVENT_UDMACH28SSEL_EV_W                                              8
#define EVENT_UDMACH28SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH28SSEL_EV_S                                              0
#define EVENT_UDMACH28SSEL_EV_UART2_RX_DMASREQ                      0x00000088

//*****************************************************************************
//
// Register: EVENT_O_UDMACH28BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART2_RX_DMABREQ         UART2 RX DMA burst request, controlled by
//                          UART2:DMACTL.RXDMAE
#define EVENT_UDMACH28BSEL_EV_W                                              8
#define EVENT_UDMACH28BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH28BSEL_EV_S                                              0
#define EVENT_UDMACH28BSEL_EV_UART2_RX_DMABREQ                      0x00000087

//*****************************************************************************
//
// Register: EVENT_O_UDMACH29SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART2_TX_DMASREQ         UART2 TX DMA single request, controlled by
//                          UART2:DMACTL.TXDMAE
#define EVENT_UDMACH29SSEL_EV_W                                              8
#define EVENT_UDMACH29SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH29SSEL_EV_S                                              0
#define EVENT_UDMACH29SSEL_EV_UART2_TX_DMASREQ                      0x0000008A

//*****************************************************************************
//
// Register: EVENT_O_UDMACH29BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART2_TX_DMABREQ         UART2 TX DMA burst request, controlled by
//                          UART2:DMACTL.TXDMAE
#define EVENT_UDMACH29BSEL_EV_W                                              8
#define EVENT_UDMACH29BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH29BSEL_EV_S                                              0
#define EVENT_UDMACH29BSEL_EV_UART2_TX_DMABREQ                      0x00000089

//*****************************************************************************
//
// Register: EVENT_O_UDMACH30SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART3_RX_DMASREQ         UART3 RX DMA single request, controlled by
//                          UART3:DMACTL.RXDMAE
#define EVENT_UDMACH30SSEL_EV_W                                              8
#define EVENT_UDMACH30SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH30SSEL_EV_S                                              0
#define EVENT_UDMACH30SSEL_EV_UART3_RX_DMASREQ                      0x0000008C

//*****************************************************************************
//
// Register: EVENT_O_UDMACH30BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART3_RX_DMABREQ         UART3 RX DMA burst request, controlled by
//                          UART3:DMACTL.RXDMAE
#define EVENT_UDMACH30BSEL_EV_W                                              8
#define EVENT_UDMACH30BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH30BSEL_EV_S                                              0
#define EVENT_UDMACH30BSEL_EV_UART3_RX_DMABREQ                      0x0000008B

//*****************************************************************************
//
// Register: EVENT_O_UDMACH31SSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART3_TX_DMASREQ         UART3 TX DMA single request, controlled by
//                          UART3:DMACTL.TXDMAE
#define EVENT_UDMACH31SSEL_EV_W                                              8
#define EVENT_UDMACH31SSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH31SSEL_EV_S                                              0
#define EVENT_UDMACH31SSEL_EV_UART3_TX_DMASREQ                      0x0000008E

//*****************************************************************************
//
// Register: EVENT_O_UDMACH31BSEL
//
//*****************************************************************************
// Field:   [7:0] EV
//
// Read only selection value
// ENUMs:
// UART3_TX_DMABREQ         UART3 TX DMA burst request, controlled by
//                          UART3:DMACTL.TXDMAE
#define EVENT_UDMACH31BSEL_EV_W                                              8
#define EVENT_UDMACH31BSEL_EV_M                                     0x000000FF
#define EVENT_UDMACH31BSEL_EV_S                                              0
#define EVENT_UDMACH31BSEL_EV_UART3_TX_DMABREQ                      0x0000008D

